app/controllers/api/patterns_controller.rb

  def update
    @pattern_rows = PatternRow.where(:pattern_id => params[:pattern_id]).order('id DESC')
    updated_grid = JSON.parse(params[:rows])

    for i in 0..9
      pattern_row = PatternRow.find(@pattern_rows[i].id)
      pattern_row.row = updated_grid[i]
      pattern_row.save
---
SELECT "pattern_rows".* FROM "pattern_rows" WHERE "pattern_rows"."pattern_id" = $1 ORDER BY id DESC  [["pattern_id", 9]]
SELECT  "pattern_rows".* FROM "pattern_rows" WHERE "pattern_rows"."id" = $1 ORDER BY id DESC LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "pattern_rows" SET "row" = $1, "updated_at" = $2 WHERE "pattern_rows"."id" = $3  [["row", "{p,p,p,\"\",\"\",\"\",\"\",\"\",\"\",p}"], ["updated_at", "2017-11-16 10:21:30.405118"], ["id", 18]]