app/views/patterns/index.html.erb

    <section id="pattern-index-card">
      <% pattern.pattern_rows.each do |row_arr| %>
---
SELECT "pattern_rows".* FROM "pattern_rows" WHERE "pattern_rows"."pattern_id" = $1 ORDER BY id DESC  [["pattern_id", 11]]
SELECT "patterns".* FROM "patterns"