app/controllers/patterns_controller.rb

  def index
    @patterns = Pattern.all
---
SELECT "patterns".* FROM "patterns"

  def create
    pattern = Pattern.new
    pattern.name = params[:name]
    pattern.description = params[:description]
    pattern.user_id = current_user.id
    pattern.save
    counter = 0
    while  counter < 10
      pattern_row = PatternRow.new
      pattern_row.row = ['', '', '', '', '', '', '', '', '', '']
      pattern_row.pattern_id = pattern.id
      pattern_row.save
---
INSERT INTO "patterns" ("user_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["name", "colour work"], ["description", "fair isle"], ["created_at", "2017-11-15 00:50:13.563927"], ["updated_at", "2017-11-15 00:50:13.563927"]]
INSERT INTO "pattern_rows" ("pattern_id", "row", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pattern_id", 6], ["row", "{\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\",\"\"}"], ["created_at", "2017-11-15 23:24:42.522103"], ["updated_at", "2017-11-15 23:24:42.522103"]]

  def show
    @pattern = Pattern.find(params[:id])
---
SELECT  "patterns".* FROM "patterns" WHERE "patterns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @pattern = Pattern.find(params[:id])
    @pattern_rows = @pattern.pattern_rows
    @rows_arr = []
    @pattern_rows.each do |row_arr|
---
SELECT  "patterns".* FROM "patterns" WHERE "patterns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pattern_rows".* FROM "pattern_rows" WHERE "pattern_rows"."pattern_id" = $1 ORDER BY id DESC  [["pattern_id", 1]]