app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hermione"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(username: params[:username].downcase)