app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.username = params[:username]
    @user.email = params[:email]
    if User.find_by(username: username)
      @errors = "Username already taken"
      render :new
    else
      @user.password = params[:password]
      @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "holly_golightly"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"